# 3.選擇性敘述的練習 - electricity
# 輸入何種用電和度數，計算出需繳之電費。
# 電力公司使用累計方式來計算電費，分工業用電及家庭用電。
#
#               家庭用電   工業用電
#
# 120度(含)以下   1.63元    0.5元
# 121~330(含)度  2.38元    0.5元
# 330度以上       3.52元   0.5元

elec = input("請輸入何種用電?\n1.家庭用電\t2.工業用電")
num = float(input("請輸入幾度電?"))
a = num * 1.63
b = 120 * 1.63 + (num - 120) * 2.38
c = 120 * 1.63 + (num - 120) * 2.38 + (num - 330) * 3.52
d = num * 0.5
if elec == "1":
    print("1.家庭用電")
    if num <= 120:
        print(a, "元")
    elif 120 < num <= 330:
        print(b, "元")
    elif num > 330:
        print(c, "元")
elif elec == "2":
    print("2.工業用電")
    print(d, "元")
else:
    print("輸入錯誤")
